12/data/attachments/fae564bf9d75348c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:username>
            <nif:friendToBeAdded>Jennifer_long_Friend_55799_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>